app/models/user.rb

    def reset_session_token!
        self.update!(session_token:SecureRandom.urlsafe_base64(16) )
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "qD28MnPQdgPzLq06f9L15Q"], ["updated_at", "2019-11-04 22:11:30.484396"], ["id", 3]]